tutorials/BalmforthKerswell01/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    backAndFront
    {
				type            fixedFluxPressure;
				value  					uniform 0;
    }
    walls
    {
				type            fixedFluxPressure;
				value  					uniform 0;
    }
		bottom
    {
				type            fixedFluxPressure;
				value  					uniform 0;
    }
		top
    {
        type            totalPressure;
        p0              uniform 0;
    }
}


// ************************************************************************* //
