tutorials/BalmforthKerswell01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (0    0    0) // 0
    (0.4  0    0) // 1
    (0.4  0.1  0) // 2
    (0    0.1  0) // 3
    (0    0    0.3) // 4
    (0.4  0    0.3) // 5
    (0.4  0.1  0.3) // 6
    (0    0.1  0.3) // 7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 1 60) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (160 1 120) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (40 1 30) simpleGrading (1 1 1)
);

edges
(
    // spline 0 1
    // (
    //     (400 0 300)
    // )
    //
    // spline 2 3
    // (
    //     (400 50 300)
    // )
    //
    // spline 4 5
    // (
    //     (400 0 350)
    // )
    //
    // spline 6 7
    // (
    //     (400 50 350)
    // )
);

boundary
(
    backAndFront
    {
        type wall;
        faces
        (
            (5 4 0 1)
            (7 6 2 3)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (3 2 1 0)
            (4 7 3 0)
            (6 5 1 2)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
